Repository: gnaservicesinc/psychic-guacamole
Catalog: po/*.po
Languages: si

source: Choose Font
si: ෆොන්ට තෝරාගන්න

source: Show Line Numbers
si: පෙළ අංකනය දක්වන්න

source: Show Language
si: භාෂාව පෙන්වන්න

source: Auto Indent
si: ස්වයංක්‍රීය එබුම

source: Spell Check
si: අක්ෂර වින්‍යාසය පිරික්සන්න

source: Show Full File Path
si: පුර්ණ ගොනු පෙත පෙන්වන්න

source: Display UI Settings
si: UI සිටුවම් විදැහන්න

source: Default Window Width
si: කවුළුවේ පෙරනිමි පළල

source: Default Window Height
si: කවුළුවේ පෙරනිමි උස

source: Set Maximum Undo Level (0 For Unlimited) :
si: අහෝසි කළහැකි උපරිම වාර ගණන සකසන්න (අසීමිත 0)

source: Find / Find & Replace Text
si: සොයන්න/ සොයන්න සහ පෙළ ප්‍රතිස්ථාපනය කරන්න

source: Search Text For:
si: සඳහා පෙළ සොයන්න:

source: Error!
si: දෝෂයක්!

source: Replace Text With:
si: සමඟ පෙළ ප්‍රතිස්ථාපනය:

source: Find
si: සොයන්න

source: Replace
si: ප්‍රතිස්ථාපනය කරන්න

source: Text was modified! Save it?
si: පෙළ වෙනස්කර ඇත එය සුරකින්නද?

source: en_US
si: si

source: Keep Window Above
si: ඉහළ කවුළුව නොවෙනස්ව තබාගන්න

source: Wrap Lines
si: පේළි එතුම

source: Use Temp and Check For (lock/tmp/swp)
si: තාවකාලිකය භාවිතා කිරීම සහ අන්වේක්ෂණය සඳහා (lock/tmp/swp)

source: That simple, fast, and user friendly text editor you love.
si: සරලය , වේගවත් ,ඔබ කැමති පරිශීලක මිත්‍රශීලි පෙළ සකසනය

source: translator-credits
si: Launchpad Contributions: GNAServicesInc https://launchpad.net/~gnaservicesinc nuwan pushpakumara https://launchpad.net/~pushworld7

source: Reading file failed!
si: ගොනුව කියවීම අසාර්ථකයි!

source: Conversion to UTF-8 FAILED! Is this a text document?
si: එය අක්ෂර ලේඛනයක්ද? UTF-8 සඳහා පරිවර්තනය අසාර්ථකයි!

source: _New File
si: නව ගොනුවක් (_N)

source: _Save File
si: ගොනුව සුරකින්න (_S)

source: _Open File
si: ගොනුව විවෘත කරන්න (_O)

source: _Undo
si: නිෂ්ප්‍රභා කරන්න (_U)

source: _Redo
si: නැවත කරන්න (_R)

source: R_eload
si: රීලෝඩ්

source: _Preferences
si: අභිරුචින් (_P)

source: WARNING: Saving File Failed! Unable to write to file:
si: දැනුම්දීමයි: ගොනුව සුරැකුම අසාර්ථකයි! ගොනුව තුළ ලිවීම කළ නොහැක:

source: Save File
si: ගොනුව සුරකින්න

source: Thread could not be created
si: පොට නිර්මාණය කළනොහැකිය

source: Word Count
si: වචන ප්‍රමාණය

source: Word Count:
si: වචන ප්‍රමාණය:

source: Char Count:
si: අනුලකුණු ප්‍රමාණය

source: Line Count:
si: පෙළ ප්‍රමාණය

source: Reverse
si: ප්‍රතිලෝමය

source: To upper case
si: ඉහල වින්‍යාසය දක්වා

source: Config file is invalid. Failed to remove bad config file. Please manually remove it.
si: අවලංගු වින්‍යාස ගොනුවකි. සදොස් වින්‍යාස ගොනුව ඉවත් කිරීම අසාර්ථකයි. කරුණාකර හස්තීයව එය ඉවත් කරන්න.

source: Config file is invalid.
si: අවලංගු වින්‍යාසයකි.

source: Successfully removed bad config file. A new config file will be created. Press ok and tpad will restart...
si: සදොස් වින්‍යාස ගොනුව සාර්ථකව ඉවත්කරන ලදී. නව වින්‍යාස ගොනුවක් නිර්මාණය වෙමින් පවතී. ok එබීමෙන් අනතුරුව tpad යළි ආරම්භවේ...

source: Error settings value out of range, change dropped. The change will not be saved. However, you REALLY should save your work and exit tpad right now. Please report bug
si: සදොස් සිටුවම් අගය පරාසයෙන් පිටත වේ, හෙළුම වෙනස් කරන්න. වෙනස සුරැකෙන්නේ නැත. කෙසේ හෝ ඔබ ඔබගේ වැඩපත සුරැකීමෙන් අනතුරුව වහාම tpad තුලින් ඉවත් වන්න. කරුණාකර දෝෂය වර්තා කරන්න

source: Error! The default window size must have a height of 50 or more and a width of 25 or more.
si: දෝෂයක්! පෙරනිමි කවුළුව 50ක හෝ වඩා වැඩි උස ප්‍රමාණයකින් හා පළල 25 ක හෝ වඩා වැඩි ප්‍රමාණයකින් යුක්ත විය යුතුය.

source: To lower case
si: පහල වින්‍යාසය දක්වා

source: File may alread be open in tpad or another program!
si: ගොනුව tpad තුළ හෝ වෙනත් වැඩසටහනක් තුළ විවෘත වී තිබිය හැක!

source: Do you still want to open the file? ------------------------------------ Description - File has a swap or temp file. Possible Causes -- *File might be in-use already. *tpad or another program crashed or exited improperly while using this file. *other unknown reasons Details -- File path:%s Path to tmp or swp file:%s
si: ඔබට තවමත් ගොනුව විවෘත කිරීමට අවශ්‍යද? ------------------------------------ සටහන - ගොනුව තුළ හුවමාරු හෝ තාවකාලික ගොනුවක් තිබිය හැක. වියහැකි කාරණා-- *ගොනුව දැනටමත් භාවිතා වන්නට පුළුවන. *මෙම ගොනුව භාවිතා කරන අතරතුරදී tpad හෝ වෙනත් වැඩසටහනක් ක්‍රියාවිරහිත වී හෝ අනිසි අයුරින් ඉවත්වී ඇත. *වෙනත් නොදන්නා හේතූන් තොරතුරු-- ගොනු පෙත:%s හුවමාරු හෝ තාවකාලික ගොනු සඳහා පෙත:%s

source: Error invalid method. An error has occurred! Please save you work and exit tpad. Please report a bug!
si: දෝෂයක් අවලංගු ක්‍රමවේදයකි. දෝෂයක් සිදුවී ඇත! කරුණාකර ඔබගේ වැඩපත සුරැකීමෙන් අනතුරුව tpad තුළින් ඉවත්වන්න. කරණාකර දෝෂය වර්තාකරන්න!

source: File Is Not A Text File -- BAD MAGIC
si: ගොනුව පෙළ ගොනුවක් නොවේ-- BAD MAGIC

source: Oh-No! I was unable to initialize magic the magic library Skipping magic!
si: Oh-No! මාහට magic පුස්තකාලයේ magic ආරම්භ කිරීමට නොහැකි විය magic මගහරින්න!

source: Uh-oh! I can not load the magic database Skipping!
si: Uh-oh! මාහට magic දත්ත සමුදාය ඇතුල් කිරීමට නොහැක මගහරින්න!

source: Document text changes have failed! coult not convert the new content to UTF-8.
si: ලේඛනයේ පෙළ වෙනස් කිරීම අසාර්ථකයි! අන්තර්ගතය UTF-8 දක්වා පරිවර්තනය කළ නොහැක.

source: Redo
si: නැවත කරන්න

source: Undo
si: නිෂ්ප්‍රභා කරන්න

source: New
si: අළුත්

source: Error Deatils:
si: දෝෂ තොරතුරු:

source: An error has occured: %s
si: වරදක් සිදු වී ඇත: %s

source: An error has occured and the program may abort. Any unsaved work may be lost. If you belive that a bug in tpad is the root cause report a bug at https://bugs.launchpad.net/tpad-project The following message may help you determine the cause %s
si: වරදක් සිදු වී ඇත වැඩසටහන ගබ්සා වේ. නොසුරැකු වැඩ නැති වියහැක. ඔබ සිතනා පරිදි මෙය tpad මූලය තුල හටගත් දෝෂයක් වියහැකි නම් දෝෂය වෙත වර්තාකරන්න https://bugs.launchpad.net/tpad-project අනුගාමී පණිවුඩය ඔබට දෝෂ නිධානය තීරණය කිරීමට උපකාරීවනු ඇත %s

source: Untitled
si: නිර්ණාමික
